# Слияние списков

n, m = map(int, input().split())
list_1, list_2 = list(map(int, input().split())), list(map(int, input().split()))

# Два указателя и итоговый список
i, j, res = 0, 0, []

# Проверяем, что указатели находятся в границе списков
while i < len(list_1) and j < len(list_2):

    # Если элемент "i" 1 списка меньше элемента "j" 2 списка:
    # добавляем в итоговый список элемент "i"
    # прибавляем 1 к указателю "i"
    if list_1[i] < list_2[j]:
        res.append(list_1[i])
        i += 1

    # Иначе, это значит что элемент "j" меньше элемента "i":
    # добавляем в итоговый список элемент "j"
    # прибавляем 1 к указателю "j"
    else:
        res.append(list_2[j])
        j += 1

# Добавляем элементы из 1 списка которые мы пропустили, если они есть
while i < len(list_1):
    res.append(list_1[i])
    i += 1

# Добавляем элементы из 2 списка которые мы пропустили, если они есть
while j < len(list_2):
    res.append(list_2[j])
    j += 1

print(res)